noless-zz/esp8266-led-portal/src/main.cpp
    const err = payload && payload.error ? payload.error : xhr.responseText;
    statusMsg.textContent = `Upload failed: ${err}`;
    statusMsg.className = 'status-msg status-err';
    document.getElementById('uploadBtn').disabled = false;
  });
  xhr.addEventListener('error', () => {
    statusMsg.textContent = 'Connection error';
    statusMsg.className = 'status-msg status-err';
    document.getElementById('uploadBtn').disabled = false;
  });
  xhr.open('POST', '/api/update?approve=1');
  xhr.send(formData);
}

function scanWifi(attempt = 0) {
  const list = document.getElementById('ssidList');
  const msg = document.getElementById('wifiMsg');
  if (attempt === 0) {
    msg.textContent = 'Scanning...';
    msg.className = 'status-msg';
  }
  fetch('/api/wifi/scan').then(r => r.json()).then(d => {
    if (d.scanning) {
      if (attempt > 25) {
        msg.textContent = 'Scan timeout';
        msg.className = 'status-msg status-err';
        return;
      }
      setTimeout(() => scanWifi(attempt + 1), 350);
      return;
    }

    list.innerHTML = '';
    if (!d.networks || d.networks.length === 0) {
      const opt = document.createElement('option');
      opt.value = '';
      opt.textContent = 'No networks found';
      list.appendChild(opt);
      msg.textContent = 'No SSIDs detected';
      return;
    }
    d.networks.forEach(n => {
      const opt = document.createElement('option');
      opt.value = n.ssid;
      opt.textContent = `${n.ssid} (${n.rssi} dBm)`;
      list.appendChild(opt);
    });
    msg.textContent = `Found ${d.networks.length} networks`;
    msg.className = 'status-msg status-ok';
  }).catch(() => {
    msg.textContent = 'Scan failed';
    msg.className = 'status-msg status-err';
  });
}

function connectWifi() {
  const ssid = document.getElementById('ssidList').value;
  const pass = document.getElementById('wifiPass').value;
  const msg = document.getElementById('wifiMsg');
  if (!ssid) {
    msg.textContent = 'Select an SSID first';
    msg.className = 'status-msg status-err';
    return;
  }
  msg.textContent = `Connecting to ${ssid}...`;
  msg.className = 'status-msg';

  const pollConnect = (attempt = 0) => {
    fetch('/api/wifi/connect').then(r => r.json()).then(d => {
      if (d.connecting) {
        if (attempt > 60) {
          msg.textContent = 'Connection timeout';
          msg.className = 'status-msg status-err';
          return;
        }
        setTimeout(() => pollConnect(attempt + 1), 500);
        return;
      }

      if (d.connected) {
        msg.textContent = `Connected! Open http://${d.hostname}.local/ or ${d.ip}`;
        msg.className = 'status-msg status-ok';
      } else {
        msg.textContent = d.error || 'Connection failed';
        msg.className = 'status-msg status-err';
      }
      pollStatus();
    }).catch(() => {
      msg.textContent = 'Connection status check failed';
      msg.className = 'status-msg status-err';
    });
  };

  const p = new URLSearchParams({ ssid, pass });
  fetch('/api/wifi/connect?' + p.toString()).then(r => r.json()).then(d => {
    if (!d.connecting) {
      msg.textContent = d.error || 'Failed to start connection';
      msg.className = 'status-msg status-err';
      return;
    }
    pollConnect();
  }).catch(() => {
    msg.textContent = 'Connection request failed';
    msg.className = 'status-msg status-err';
  });
}

// Poll status
function pollStatus() {
  fetch('/api/status').then(r => r.json()).then(d => {
    document.getElementById('heap').textContent = Math.round(d.heap / 1024) + ' KB';
    document.getElementById('apSsid').textContent = d.ap_ssid || '-';
    document.getElementById('host').textContent = d.hostname ? (d.hostname + '.local') : '-';
    document.getElementById('ip').textContent = d.ip || '-';
    document.getElementById('powerToggle').classList.toggle('on', d.power);
    document.getElementById('brightness').value = d.brightness;
    document.getElementById('brVal').textContent = d.brightness;
    document.getElementById('speed').value = d.speed;
    document.getElementById('spVal').textContent = d.speed;
    document.querySelectorAll('.fx-btn').forEach((b, i) => b.classList.toggle('active', i === d.effect));
    
    // Update connection stats
    const staCard = document.getElementById('staCard');
    if (d.connected && d.sta_ssid) {
      staCard.style.display = 'block';
      document.getElementById('staSsid').textContent = d.sta_ssid;
      document.getElementById('staSignal').textContent = d.sta_rssi + ' dBm';
      document.getElementById('staQuality').textContent = d.sta_quality;
      document.getElementById('staChannel').textContent = d.sta_channel;
      document.getElementById('staBssid').textContent = d.sta_bssid;
    } else {
      staCard.style.display = 'none';
    }
  }).catch(() => {});
}
pollStatus();
scanWifi();
setInterval(pollStatus, 5000);
</script>
</body>
</html>
)rawliteral";

// ─── Setup ───────────────────────────────────────────────
void setup() {
  Serial.begin(115200);
  Serial.println("\n\n=== LED Controller Starting ===");

  buildDeviceIdentity();
  setupLEDs();
  loadLedPowerState();
  setupWiFi();
  setupDNS();
  setupMDNS();
  setupOTA();
  setupWebServer();

  Serial.println("=== Ready! AP: " + apSsid + " / Host: " + localHostname + ".local ===");
}

void loop() {
  dnsServer.processNextRequest();
  if (mdnsStarted) {
    MDNS.update();
  } else if (WiFi.status() == WL_CONNECTED) {
    setupMDNS();
  }
  updateWiFiConnect();
  checkPeriodicStaRetry();
  trackClientActivity();
  ArduinoOTA.handle();
  updateLEDs();
}

void buildDeviceIdentity() {
  String mac = WiFi.macAddress();
  mac.replace(":", "");
  deviceId = mac.substring(mac.length() - 6);
  deviceId.toUpperCase();
  apSsid = String(AP_SSID_BASE) + "-" + deviceId;
  localHostname = String("ledportal-") + deviceId;
  localHostname.toLowerCase();
}

// ─── WiFi AP ─────────────────────────────────────────────
void setupWiFi() {
  WiFi.persistent(true);
  WiFi.mode(WIFI_AP_STA);
  WiFi.hostname(localHostname.c_str());
  WiFi.softAP(apSsid.c_str(), AP_PASS);
  delay(100);
  Serial.print("AP IP: ");
  Serial.println(WiFi.softAPIP());

  if (WiFi.SSID().length() > 0 && beginWiFiConnectAttempt(8000, false)) {
    WiFi.begin(); // try saved STA credentials (non-blocking)
    Serial.println("Trying saved STA credentials...");
  }
}

