noless-zz/esp8266-led-portal/src/main.cpp
// ─── DNS (Captive Portal) ────────────────────────────────
void setupDNS() {
  if ((WiFi.getMode() & WIFI_AP) == 0) {
    return;
  }
  // Redirect all DNS queries to our IP → captive portal
  dnsServer.setErrorReplyCode(DNSReplyCode::NoError);
  dnsServer.start(DNS_PORT, "*", WiFi.softAPIP());
}

void setupMDNS() {
  if (WiFi.status() != WL_CONNECTED || mdnsStarted) {
    return;
  }
  if (MDNS.begin(localHostname.c_str())) {
    mdnsStarted = true;
    Serial.print("mDNS: http://");
    Serial.print(localHostname);
    Serial.println(".local");
  } else {
    Serial.println("mDNS start failed");
  }
}

// ─── OTA ─────────────────────────────────────────────────
void setupOTA() {
  ArduinoOTA.setHostname(localHostname.c_str());
  ArduinoOTA.setPassword(OTA_PASS);
  ArduinoOTA.onStart([]() {
    otaVisualActive = true;
    FastLED.clear();
    FastLED.show();
    Serial.println("OTA Start");
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    uint8_t pct = progress / (total / 100);
    int statusLeds = min(NUM_LEDS, OTA_STATUS_LEDS);
    int litLeds = map(pct, 0, 100, 0, statusLeds);
    FastLED.clear();
    for (int i = 0; i < litLeds; i++) {
      leds[i] = CRGB(0, 255, 0);
    }
    FastLED.show();
  });
  ArduinoOTA.onEnd([]() {
    int statusLeds = min(NUM_LEDS, OTA_STATUS_LEDS);
    FastLED.clear();
    fill_solid(leds, statusLeds, CRGB::Green);
    FastLED.show();
    otaVisualActive = false;
    Serial.println("OTA Done!");
  });
  ArduinoOTA.onError([](ota_error_t error) {
    int statusLeds = min(NUM_LEDS, OTA_STATUS_LEDS);
    FastLED.clear();
    fill_solid(leds, statusLeds, CRGB::Red);
    FastLED.show();
    otaVisualActive = false;
    Serial.printf("OTA Error[%u]\n", error);
  });
  ArduinoOTA.begin();
}

// ─── LEDs ────────────────────────────────────────────────
void setupLEDs() {
  FastLED.addLeds<WS2812, LED_PIN, GRB>(leds, NUM_LEDS);
  FastLED.setBrightness(state.brightness);
  FastLED.clear(true);
}

void updateLEDs() {
  if (otaVisualActive) {
    return;
  }

  if (!state.power) {
    EVERY_N_MILLISECONDS(100) {
      FastLED.clear(true);
    }
    return;
  }

  unsigned long interval = map(state.speed, 1, 255, 60, 5);
  unsigned long now = millis();
  if (now - lastUpdate < interval) return;
  lastUpdate = now;

  switch (state.effect) {
    case 0: effectSolid();    break;
    case 1: effectRainbow();  break;
    case 2: effectChase();    break;
    case 3: effectBreathe();  break;
    case 4: effectFire();     break;
    case 5: effectTwinkle();  break;
    case 6: effectWave();     break;
    case 7: effectGradient(); break;
  }
  FastLED.show();
}

// ─── Effects ─────────────────────────────────────────────
void effectSolid() {
  fill_solid(leds, NUM_LEDS, state.color1);
}

void effectRainbow() {
  fill_rainbow(leds, NUM_LEDS, effectHue++, 7);
}

void effectChase() {
  fadeToBlackBy(leds, NUM_LEDS, 40);
  int pos = beatsin16(map(state.speed, 1, 255, 10, 100), 0, NUM_LEDS - 1);
  leds[pos] = state.color1;
}

void effectBreathe() {
  uint8_t val = beatsin8(map(state.speed, 1, 255, 10, 60), 30, 255);
  CRGB c = state.color1;
  c.nscale8(val);
  fill_solid(leds, NUM_LEDS, c);
}

void effectFire() {
  static byte heat[NUM_LEDS];
  // Cool down
  for (int i = 0; i < NUM_LEDS; i++) {
    heat[i] = qsub8(heat[i], random8(0, ((55 * 10) / NUM_LEDS) + 2));
  }
  // Heat drifts up
  for (int k = NUM_LEDS - 1; k >= 2; k--) {
    heat[k] = (heat[k - 1] + heat[k - 2] + heat[k - 2]) / 3;
  }
  // Ignite
  if (random8() < 160) {
    int y = random8(7);
    heat[y] = qadd8(heat[y], random8(160, 255));
  }
  // Map to colors
  for (int j = 0; j < NUM_LEDS; j++) {
    leds[j] = HeatColor(heat[j]);
  }
}

void effectTwinkle() {
  fadeToBlackBy(leds, NUM_LEDS, 20);
  if (random8() < 80) {
    int pos = random16(NUM_LEDS);
    leds[pos] = random8() > 128 ? state.color1 : state.color2;
  }
}

void effectWave() {
  for (int i = 0; i < NUM_LEDS; i++) {
    uint8_t wave = sin8(i * 10 + effectHue);
    leds[i] = blend(state.color1, state.color2, wave);
  }
  effectHue += 2;
}

void effectGradient() {
  fill_gradient_RGB(leds, 0, state.color1, NUM_LEDS - 1, state.color2);
}

// ─── Status JSON ─────────────────────────────────────────
String getStatusJson() {
  JsonDocument doc;
  doc["power"]      = state.power;
  doc["brightness"] = state.brightness;
  doc["effect"]     = state.effect;
  doc["speed"]      = state.speed;
  doc["heap"]       = ESP.getFreeHeap();
  doc["ap_ssid"]    = apSsid;
  doc["hostname"]   = localHostname;
  doc["connected"]  = WiFi.status() == WL_CONNECTED;
  doc["ip"]         = WiFi.status() == WL_CONNECTED ? WiFi.localIP().toString() : WiFi.softAPIP().toString();
  
  // Connection stats
  if (WiFi.status() == WL_CONNECTED) {
    doc["sta_ssid"]  = WiFi.SSID();
    doc["sta_rssi"]  = WiFi.RSSI();
    doc["sta_channel"] = WiFi.channel();
    doc["sta_bssid"] = WiFi.BSSIDstr();
    int rssi = WiFi.RSSI();
    String quality = "Excellent";
    if (rssi < -80) quality = "Poor";
    else if (rssi < -70) quality = "Fair";
    else if (rssi < -60) quality = "Good";
    doc["sta_quality"] = quality;
  } else {
    doc["sta_ssid"]  = WiFi.SSID().length() > 0 ? WiFi.SSID() : "";
    doc["sta_rssi"]  = 0;
    doc["sta_channel"] = 0;
    doc["sta_bssid"] = "";
    doc["sta_quality"] = "Not connected";
  }
  doc["ap_active"]  = (WiFi.getMode() & WIFI_AP) != 0;
  doc["ap_clients"] = WiFi.softAPgetStationNum();
  
  char c1[8], c2[8];
  snprintf(c1, sizeof(c1), "#%02x%02x%02x", state.color1.r, state.color1.g, state.color1.b);
  snprintf(c2, sizeof(c2), "#%02x%02x%02x", state.color2.r, state.color2.g, state.color2.b);
  doc["color1"] = c1;
  doc["color2"] = c2;
  String out;
  serializeJson(doc, out);
  return out;
}

String getWifiScanJson() {
  JsonDocument doc;
  JsonArray arr = doc["networks"].to<JsonArray>();

  int scanState = WiFi.scanComplete();

  if (scanState == WIFI_SCAN_RUNNING) {
    doc["scanning"] = true;
  } else if (scanState == WIFI_SCAN_FAILED) {
    WiFi.scanDelete();
    WiFi.scanNetworks(true, true);
    doc["scanning"] = true;
  } else {
    doc["scanning"] = false;
    scanCacheCount = 0;
    for (int i = 0; i < scanState; i++) {
      String ssid = WiFi.SSID(i);
      if (ssid.length() == 0) continue;
      JsonObject obj = arr.add<JsonObject>();
      obj["ssid"] = ssid;
      obj["rssi"] = WiFi.RSSI(i);
      obj["enc"]  = (WiFi.encryptionType(i) != ENC_TYPE_NONE);

      if (scanCacheCount < MAX_SCAN_CACHE) {
        scanCache[scanCacheCount].ssid = ssid;
        scanCache[scanCacheCount].rssi = WiFi.RSSI(i);
        scanCache[scanCacheCount].channel = WiFi.channel(i);
        scanCache[scanCacheCount].enc = WiFi.encryptionType(i);
        scanCacheCount++;
      }
    }
    scanCacheUpdatedAt = millis();
    WiFi.scanDelete();
    if (scanState <= 0) {
      WiFi.scanNetworks(true, true);
      doc["scanning"] = true;
    }
  }

  String out;
  serializeJson(doc, out);
  return out;
}

void loadLedPowerState() {
  EEPROM.begin(EEPROM_SIZE);
  uint8_t magic = EEPROM.read(EEPROM_MAGIC_ADDR);
  if (magic == EEPROM_MAGIC) {
    state.power = EEPROM.read(EEPROM_POWER_ADDR) == 1;
  } else {
    EEPROM.write(EEPROM_MAGIC_ADDR, EEPROM_MAGIC);
    EEPROM.write(EEPROM_POWER_ADDR, state.power ? 1 : 0);
    EEPROM.commit();
  }
  Serial.printf("[LED] Restored power state: %s\n", state.power ? "ON" : "OFF");
}

void saveLedPowerState() {
  EEPROM.write(EEPROM_MAGIC_ADDR, EEPROM_MAGIC);
  EEPROM.write(EEPROM_POWER_ADDR, state.power ? 1 : 0);
  EEPROM.commit();
  Serial.printf("[LED] Saved power state: %s\n", state.power ? "ON" : "OFF");
}

uint32_t getMaxUpdateSize() {
  return (ESP.getFreeSketchSpace() - 0x1000) & 0xFFFFF000;
}

