noless-zz/esp8266-led-portal/src/main.cpp
const char* updateErrorToString(uint8_t error) {
  switch (error) {
    case UPDATE_ERROR_OK: return "OK";
    case UPDATE_ERROR_WRITE: return "Flash write failed";
    case UPDATE_ERROR_ERASE: return "Flash erase failed";
    case UPDATE_ERROR_READ: return "Flash read failed";
    case UPDATE_ERROR_SPACE: return "Not enough flash space";
    case UPDATE_ERROR_SIZE: return "Binary size mismatch";
    case UPDATE_ERROR_STREAM: return "Upload stream timeout/error";
    case UPDATE_ERROR_MD5: return "MD5 validation failed";
    case UPDATE_ERROR_MAGIC_BYTE: return "Invalid firmware magic byte";
    case UPDATE_ERROR_FLASH_CONFIG: return "Flash config mismatch";
    case UPDATE_ERROR_NEW_FLASH_CONFIG: return "New flash config invalid";
    case UPDATE_ERROR_BOOTSTRAP: return "Bootstrap validation failed";
    case UPDATE_ERROR_OOM: return "Out of memory during update";
    case UPDATE_ERROR_NO_DATA: return "No OTA data received";
    default: return "Unknown OTA error";
  }
}

String getOtaStatusJson() {
  JsonDocument doc;
  doc["in_progress"] = otaStatus.inProgress;
  doc["approved"] = otaStatus.approved;
  doc["last_success"] = otaStatus.lastSuccess;
  doc["last_error_code"] = otaStatus.lastErrorCode;
  doc["last_error_text"] = otaStatus.lastErrorText;
  doc["last_file"] = otaStatus.lastFileName;
  doc["expected_bytes"] = otaStatus.expectedBytes;
  doc["written_bytes"] = otaStatus.writtenBytes;
  doc["started_at"] = otaStatus.startedAt;
  doc["finished_at"] = otaStatus.finishedAt;
  doc["max_size"] = getMaxUpdateSize();
  doc["free_heap"] = ESP.getFreeHeap();
  String out;
  serializeJson(doc, out);
  return out;
}

const char* wifiStatusToString(wl_status_t status) {
  switch (status) {
    case WL_NO_SHIELD: return "NO_SHIELD";
    case WL_IDLE_STATUS: return "IDLE";
    case WL_NO_SSID_AVAIL: return "NO_SSID";
    case WL_SCAN_COMPLETED: return "SCAN_COMPLETED";
    case WL_CONNECTED: return "CONNECTED";
    case WL_CONNECT_FAILED: return "CONNECT_FAILED";
    case WL_CONNECTION_LOST: return "CONNECTION_LOST";
    case WL_WRONG_PASSWORD: return "WRONG_PASSWORD";
    case WL_DISCONNECTED: return "DISCONNECTED";
    default: return "UNKNOWN";
  }
}

const char* wifiEncryptionToString(int enc) {
  switch (enc) {
    case ENC_TYPE_NONE: return "OPEN";
    case ENC_TYPE_WEP: return "WEP";
    case ENC_TYPE_TKIP: return "WPA_TKIP";
    case ENC_TYPE_CCMP: return "WPA2_CCMP";
    case ENC_TYPE_AUTO: return "AUTO";
    default: return "UNKNOWN";
  }
}

String buildWifiFailureHint() {
  if (!wifiConnect.targetSeenInScan) {
    if (scanCacheCount <= 0 || scanCacheUpdatedAt == 0) {
      return "No recent scan cache available. Press Scan again before Connect. ESP8266 is 2.4GHz-only (cannot join 5GHz).";
    }
    return "SSID not seen in scan. ESP8266 is 2.4GHz-only (cannot join 5GHz). Ensure 2.4GHz SSID broadcast is enabled.";
  }

  if (wifiConnect.lastStatus == WL_WRONG_PASSWORD) {
    return "Wrong password or incompatible security mode. Use WPA2/WPA mixed mode (WPA3-only is not supported on ESP8266).";
  }

  if (wifiConnect.lastStatus == WL_NO_SSID_AVAIL) {
    return "AP not available right now. Check signal, channel, and whether MAC filtering is enabled.";
  }

  if (wifiConnect.lastStatus == WL_CONNECT_FAILED) {
    return "Association/authentication failed. Try WPA2-PSK AES, avoid WPA3-only/enterprise, and verify router compatibility.";
  }

  return "Connection timed out. Verify 2.4GHz SSID, password, security mode, and signal quality.";
}

String getCaptivePortalUrl() {
  if ((WiFi.getMode() & WIFI_AP) != 0) {
    return String("http://") + WiFi.softAPIP().toString() + "/";
  }
  return String("http://") + localHostname + ".local/";
}

bool startWiFiConnect(const String& ssid, const String& pass) {
  if (ssid.length() == 0) {
    return false;
  }

  if (!beginWiFiConnectAttempt(15000, true)) {
    return false;
  }

  WiFi.mode(WIFI_AP_STA);
  WiFi.hostname(localHostname.c_str());

  wifiConnect.attemptedSsid = ssid;
  wifiConnect.passLen = pass.length();
  wifiConnect.lastStatus = WiFi.status();
  wifiConnect.targetSeenInScan = false;
  wifiConnect.targetChannel = -1;
  wifiConnect.targetRssi = 0;
  wifiConnect.targetEnc = -1;
  wifiConnect.lastElapsedMs = 0;

  if (scanCacheCount > 0) {
    for (int i = 0; i < scanCacheCount; i++) {
      if (scanCache[i].ssid == ssid) {
        wifiConnect.targetSeenInScan = true;
        wifiConnect.targetChannel = scanCache[i].channel;
        wifiConnect.targetRssi = scanCache[i].rssi;
        wifiConnect.targetEnc = scanCache[i].enc;
        break;
      }
    }
  }

  WiFi.begin(ssid.c_str(), pass.c_str());
  Serial.println("[WiFi] Connecting...");
  Serial.println("[WiFi] SSID: " + ssid);
  Serial.printf("[WiFi] Password length: %u\n", wifiConnect.passLen);
  Serial.printf("[WiFi] Status before begin: %s (%d)\n", wifiStatusToString(wifiConnect.lastStatus), wifiConnect.lastStatus);
  if (wifiConnect.targetSeenInScan) {
    Serial.printf("[WiFi] Target seen in scan: yes, CH=%d RSSI=%d ENC=%s (%d)\n",
      wifiConnect.targetChannel,
      (int)wifiConnect.targetRssi,
      wifiEncryptionToString(wifiConnect.targetEnc),
      wifiConnect.targetEnc);
  } else {
    Serial.printf("[WiFi] Target seen in last scan cache: no (cache_count=%d, age_ms=%lu)\n", scanCacheCount, millis() - scanCacheUpdatedAt);
  }

  return true;
}

void updateWiFiConnect() {
  if (!wifiConnect.active) {
    return;
  }

  wifiConnect.lastStatus = WiFi.status();
  wifiConnect.lastElapsedMs = millis() - wifiConnect.startedAt;

  if (WiFi.status() == WL_CONNECTED) {
    WiFi.softAPdisconnect(true);
    WiFi.mode(WIFI_STA);
    dnsServer.stop();
    setupMDNS();
    Serial.print("WiFi connected. IP: ");
    Serial.println(WiFi.localIP());

    wifiConnect.active = false;
    wifiConnect.resultReady = wifiConnect.reportResult;
    wifiConnect.success = true;
    wifiConnect.error = "";
    Serial.printf("[WiFi] Connected to %s in %lu ms\n", wifiConnect.attemptedSsid.c_str(), wifiConnect.lastElapsedMs);
    Serial.printf("[WiFi] STA IP: %s, BSSID: %s, CH: %d, RSSI: %d\n",
      WiFi.localIP().toString().c_str(),
      WiFi.BSSIDstr().c_str(),
      WiFi.channel(),
      WiFi.RSSI());
    return;
  }

  if (millis() - wifiConnect.startedAt >= wifiConnect.timeoutMs) {
    String hint = buildWifiFailureHint();
    String errorText = String("Could not connect to '") + wifiConnect.attemptedSsid +
      "'. status=" + wifiStatusToString(wifiConnect.lastStatus) +
      " (" + String((int)wifiConnect.lastStatus) + "). " + hint;

