noless-zz/esp8266-led-portal/src/main.cpp
    Serial.println("[WiFi] Connect failed");
    Serial.printf("[WiFi] SSID: %s, elapsed: %lu ms\n", wifiConnect.attemptedSsid.c_str(), wifiConnect.lastElapsedMs);
    Serial.printf("[WiFi] Final status: %s (%d)\n", wifiStatusToString(wifiConnect.lastStatus), wifiConnect.lastStatus);
    if (wifiConnect.targetSeenInScan) {
      Serial.printf("[WiFi] Scan cache target: CH=%d RSSI=%d ENC=%s (%d)\n",
        wifiConnect.targetChannel,
        (int)wifiConnect.targetRssi,
        wifiEncryptionToString(wifiConnect.targetEnc),
        wifiConnect.targetEnc);
    } else {
      Serial.println("[WiFi] Scan cache target: not seen");
    }
    Serial.println("[WiFi] Hint: " + hint);

    wifiConnect.active = false;
    wifiConnect.resultReady = wifiConnect.reportResult;
    wifiConnect.success = false;
    wifiConnect.error = errorText;
    
    // Fallback to AP mode on failure
    ensureApFallback();
  }
}

void ensureApFallback() {
  if ((WiFi.getMode() & WIFI_AP) == 0) {
    Serial.println("[WiFi] STA failed, re-enabling AP fallback");
    WiFi.mode(WIFI_AP_STA);
    WiFi.softAP(apSsid.c_str(), AP_PASS);
    delay(100);
    setupDNS();
    Serial.print("[WiFi] AP fallback IP: ");
    Serial.println(WiFi.softAPIP());
  }
}

void trackClientActivity() {
  static unsigned long lastCheck = 0;
  if (millis() - lastCheck < 5000) return;
  lastCheck = millis();
  
  activeClientCount = WiFi.softAPgetStationNum();
  if (activeClientCount > 0) {
    lastClientActivity = millis();
  }
}

void checkPeriodicStaRetry() {
  // Only retry if:
  // 1. Not currently connecting
  // 2. Not connected
  // 3. Have saved credentials
  // 4. Retry interval elapsed
  // 5. No active clients (or client inactive for 2min)
  
  if (wifiConnect.active) return;
  if (WiFi.status() == WL_CONNECTED) return;
  if (WiFi.SSID().length() == 0) return;
  if (millis() - lastStaRetryAt < STA_RETRY_INTERVAL) return;
  
  bool hasRecentActivity = (millis() - lastClientActivity < 120000);
  if (activeClientCount > 0 && hasRecentActivity) return;
  
  Serial.println("[WiFi] Periodic STA retry attempt");
  lastStaRetryAt = millis();
  
  if (beginWiFiConnectAttempt(15000, false)) {
    WiFi.mode(WIFI_AP_STA);
    WiFi.hostname(localHostname.c_str());
    WiFi.begin();
    Serial.printf("[WiFi] Retrying saved SSID: %s\n", WiFi.SSID().c_str());
  }
}

// ─── Parse hex color ─────────────────────────────────────
CRGB parseHexColor(const String& hex) {
  String h = hex;
  if (h.startsWith("#")) h = h.substring(1);
  long val = strtol(h.c_str(), NULL, 16);
  return CRGB((val >> 16) & 0xFF, (val >> 8) & 0xFF, val & 0xFF);
}

// ─── Web Server ──────────────────────────────────────────
void setupWebServer() {
  // ── Captive portal detection endpoints ──
  // Android
  server.on("/generate_204", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });
  server.on("/gen_204", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });
  // Apple
  server.on("/hotspot-detect.html", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });
  server.on("/library/test/success.html", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });
  // Microsoft
  server.on("/connecttest.txt", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });
  server.on("/ncsi.txt", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });
  // Firefox
  server.on("/canonical.html", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });

  // ── Main page ──
  server.on("/", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send_P(200, "text/html", INDEX_HTML);
  });

  // ── API Endpoints ──
  server.on("/api/status", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/power", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("on")) {
      bool newPower = req->getParam("on")->value() == "1";
      if (state.power != newPower) {
        state.power = newPower;
        saveLedPowerState();
      }
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/brightness", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("value")) {
      state.brightness = req->getParam("value")->value().toInt();
      FastLED.setBrightness(state.brightness);
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/speed", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("value")) {
      state.speed = req->getParam("value")->value().toInt();
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/effect", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("id")) {
      state.effect = req->getParam("id")->value().toInt();
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/color", HTTP_GET, [](AsyncWebServerRequest *req) {
    if (req->hasParam("c1")) {
      state.color1 = parseHexColor(req->getParam("c1")->value());
    }
    if (req->hasParam("c2")) {
      state.color2 = parseHexColor(req->getParam("c2")->value());
    }
    req->send(200, "application/json", getStatusJson());
  });

  server.on("/api/wifi/scan", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send(200, "application/json", getWifiScanJson());
  });

  server.on("/api/wifi/connect", HTTP_GET, [](AsyncWebServerRequest *req) {
    JsonDocument doc;
    doc["hostname"] = localHostname;

    if (req->hasParam("ssid")) {
      if (wifiConnect.active) {
        doc["connecting"] = true;
      } else {
        String ssid = req->getParam("ssid")->value();
        String pass = req->hasParam("pass") ? req->getParam("pass")->value() : "";
        if (startWiFiConnect(ssid, pass)) {
          doc["connecting"] = true;
        } else {
          doc["connecting"] = false;
          doc["connected"] = false;
          doc["error"] = "Missing SSID or connection already in progress";
        }
      }
    } else if (wifiConnect.active) {
      doc["connecting"] = true;
    } else if (wifiConnect.resultReady) {
      doc["connecting"] = false;
      doc["connected"] = wifiConnect.success;
      doc["ip"] = wifiConnect.success ? WiFi.localIP().toString() : "";
      if (!wifiConnect.success) {
        doc["error"] = wifiConnect.error;
      }
      wifiConnect.resultReady = false;
    } else {
      doc["connecting"] = false;
      doc["connected"] = WiFi.status() == WL_CONNECTED;
      doc["ip"] = (WiFi.status() == WL_CONNECTED) ? WiFi.localIP().toString() : "";
      if (WiFi.status() != WL_CONNECTED) {
        doc["error"] = "No active connection attempt";
      }
    }

    JsonObject debug = doc["debug"].to<JsonObject>();
    debug["ssid"] = wifiConnect.attemptedSsid;
    debug["status"] = wifiStatusToString(wifiConnect.lastStatus);
    debug["status_code"] = (int)wifiConnect.lastStatus;
    debug["elapsed_ms"] = wifiConnect.lastElapsedMs;
    debug["target_seen"] = wifiConnect.targetSeenInScan;
    debug["target_channel"] = wifiConnect.targetChannel;
    debug["target_rssi"] = wifiConnect.targetRssi;
    debug["target_encryption"] = wifiEncryptionToString(wifiConnect.targetEnc);
    debug["target_encryption_code"] = wifiConnect.targetEnc;
    debug["scan_cache_count"] = scanCacheCount;
    debug["scan_cache_age_ms"] = scanCacheUpdatedAt > 0 ? (millis() - scanCacheUpdatedAt) : -1;
    debug["hint"] = buildWifiFailureHint();

    String out;
    serializeJson(doc, out);
    req->send(200, "application/json", out);
  });

  server.on("/api/update/status", HTTP_GET, [](AsyncWebServerRequest *req) {
    req->send(200, "application/json", getOtaStatusJson());
  });

