noless-zz/esp8266-led-portal/src/main.cpp
  server.on("/api/update/precheck", HTTP_GET, [](AsyncWebServerRequest *req) {
    JsonDocument doc;
    if (!req->hasParam("name") || !req->hasParam("size") || !req->hasParam("magic")) {
      doc["ok"] = false;
      doc["error"] = "Missing name/size/magic";
    } else {
      String name = req->getParam("name")->value();
      size_t size = (size_t) req->getParam("size")->value().toInt();
      int magic = req->getParam("magic")->value().toInt();
      uint32_t maxSize = getMaxUpdateSize();

      bool extOk = name.endsWith(".bin") || name.endsWith(".BIN");
      bool sizeOk = size > 0 && size <= maxSize;
      bool magicOk = (magic == 0xE9);

      doc["ok"] = extOk && sizeOk && magicOk;
      doc["ext_ok"] = extOk;
      doc["size_ok"] = sizeOk;
      doc["magic_ok"] = magicOk;
      doc["max_size"] = maxSize;
      doc["file_size"] = size;
      doc["magic"] = magic;

      if (doc["ok"].as<bool>()) {
        doc["summary"] = String("name=") + name + ", size=" + String(size) + " bytes, max=" + String(maxSize) + ", magic=0xE9";
      } else {
        String err;
        if (!extOk) err += "File must be .bin. ";
        if (!sizeOk) err += "File too large for available OTA space. ";
        if (!magicOk) err += "Invalid firmware header (expected 0xE9).";
        doc["error"] = err;
      }
    }
    String out;
    serializeJson(doc, out);
    req->send(200, "application/json", out);
  });

  // ── Firmware Update (HTTP) ──
  server.on("/api/update", HTTP_POST,
    // Response handler
    [](AsyncWebServerRequest *req) {
      JsonDocument doc;
      bool approved = req->hasParam("approve") && req->getParam("approve")->value() == "1";
      bool success = approved && !Update.hasError() && otaStatus.expectedBytes > 0 && otaStatus.writtenBytes == otaStatus.expectedBytes;

      otaStatus.inProgress = false;
      otaStatus.finishedAt = millis();
      otaStatus.lastSuccess = success;
      otaStatus.approved = approved;

      if (!approved) {
        otaStatus.lastErrorCode = UPDATE_ERROR_STREAM;
        otaStatus.lastErrorText = "Upload not approved. Run precheck and confirm upload in Web UI.";
      } else if (Update.hasError()) {
        otaStatus.lastErrorCode = Update.getError();
        otaStatus.lastErrorText = updateErrorToString(otaStatus.lastErrorCode);
      } else if (otaStatus.writtenBytes != otaStatus.expectedBytes) {
        otaStatus.lastErrorCode = UPDATE_ERROR_STREAM;
        otaStatus.lastErrorText = "Upload incomplete (written bytes mismatch).";
      } else {
        otaStatus.lastErrorCode = UPDATE_ERROR_OK;
        otaStatus.lastErrorText = "OK";
      }

      doc["ok"] = success;
      doc["approved"] = approved;
      doc["written"] = otaStatus.writtenBytes;
      doc["expected"] = otaStatus.expectedBytes;
      doc["error_code"] = otaStatus.lastErrorCode;
      doc["error"] = otaStatus.lastErrorText;
      doc["file"] = otaStatus.lastFileName;

      String out;
      serializeJson(doc, out);
      req->send(success ? 200 : 500, "application/json", out);

      if (success) {
        delay(600);
        ESP.restart();
      }
    },
    // Upload handler
    [](AsyncWebServerRequest *req, String filename, size_t index, uint8_t *data, size_t len, bool final) {
      if (index == 0) {
        bool approved = req->hasParam("approve") && req->getParam("approve")->value() == "1";
        if (!approved) {
          otaStatus.inProgress = false;
          otaStatus.lastSuccess = false;
          otaStatus.lastErrorCode = UPDATE_ERROR_STREAM;
          otaStatus.lastErrorText = "Missing approve=1";
          otaStatus.lastFileName = filename;
          return;
        }

        otaVisualActive = true;
        otaStatus.inProgress = true;
        otaStatus.approved = true;
        otaStatus.lastSuccess = false;
        otaStatus.lastErrorCode = 0;
        otaStatus.lastErrorText = "";
        otaStatus.lastFileName = filename;
        otaStatus.expectedBytes = req->contentLength();
        otaStatus.writtenBytes = 0;
        otaStatus.startedAt = millis();

        Serial.printf("Update: %s (%u bytes)\n", filename.c_str(), req->contentLength());
        // Disable LEDs during update
        FastLED.clear(true);
        uint32_t maxSize = getMaxUpdateSize();

        if (req->contentLength() == 0 || req->contentLength() > maxSize) {
          otaStatus.lastErrorCode = UPDATE_ERROR_SPACE;
          otaStatus.lastErrorText = "Firmware size invalid for current OTA partition.";
          otaStatus.inProgress = false;
          return;
        }

        if (!Update.begin(maxSize, U_FLASH)) {
          otaStatus.lastErrorCode = Update.getError();
          otaStatus.lastErrorText = updateErrorToString(otaStatus.lastErrorCode);
          Update.printError(Serial);
        }
      }
      if (!Update.hasError()) {
        if (Update.write(data, len) != len) {
          otaStatus.lastErrorCode = Update.getError();
          otaStatus.lastErrorText = updateErrorToString(otaStatus.lastErrorCode);
          Update.printError(Serial);
        } else {
          otaStatus.writtenBytes = index + len;
        }
        // Show progress on LEDs
        if (req->contentLength() > 0) {
          int pct = (index + len) * 100 / req->contentLength();
          int statusLeds = min(NUM_LEDS, OTA_STATUS_LEDS);
          int litLeds = map(pct, 0, 100, 0, statusLeds);
          FastLED.clear();
          for (int i = 0; i < litLeds; i++) leds[i] = CRGB::Blue;
          FastLED.show();
        }
      }
      if (final) {
        if (Update.end(true)) {
          Serial.printf("Update OK: %u bytes\n", index + len);
          otaStatus.writtenBytes = index + len;
          int statusLeds = min(NUM_LEDS, OTA_STATUS_LEDS);
          FastLED.clear();
          fill_solid(leds, statusLeds, CRGB::Green);
          FastLED.show();
          otaVisualActive = false;
        } else {
          otaStatus.lastErrorCode = Update.getError();
          otaStatus.lastErrorText = updateErrorToString(otaStatus.lastErrorCode);
          Update.printError(Serial);
          int statusLeds = min(NUM_LEDS, OTA_STATUS_LEDS);
          FastLED.clear();
          fill_solid(leds, statusLeds, CRGB::Red);
          FastLED.show();
          otaVisualActive = false;
        }
      }
    }
  );

  // ── Catch-all for captive portal ──
  server.onNotFound([](AsyncWebServerRequest *req) {
    req->redirect(getCaptivePortalUrl());
  });

  server.begin();
  Serial.println("HTTP server started");
}
